app/controllers/admin_controller.rb

SELECT "search_queries".* FROM "search_queries"
---
  def index
      @locations = SearchQuery.all