app/controllers/locations_controller.rb

  def index
      if SearchQuery.find_by(query_string: params[:query])
        @locations = SearchQuery.find_by(query_string: params[:query]).query_response
        @locations = JSON.parse(@locations.gsub! '=>', ':')
      else
          @locations = MetaWeather.new(params).search
          if !@locations.blank?
            SearchQuery.create(query_string: params[:query], query_response: @locations)
---
SELECT  "search_queries".* FROM "search_queries" WHERE "search_queries"."query_string" = $1 LIMIT $2  [["query_string", ""], ["LIMIT", 1]]
SELECT  "search_queries".* FROM "search_queries" WHERE "search_queries"."query_string" = $1 LIMIT $2  [["query_string", "a"], ["LIMIT", 1]]
SELECT  "search_queries".* FROM "search_queries" WHERE "search_queries"."query_string" = $1 LIMIT $2  [["query_string", "san francisco"], ["LIMIT", 1]]
SELECT  "search_queries".* FROM "search_queries" WHERE "search_queries"."query_string" = $1 LIMIT $2  [["query_string", "san franci"], ["LIMIT", 1]]
INSERT INTO "search_queries" ("query_string", "query_response", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"