app/controllers/search_queries_controller.rb

SELECT "search_queries".* FROM "search_queries"
---
  def index
    @search_queries = SearchQuery.all

SELECT  "search_queries".* FROM "search_queries" WHERE "search_queries"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "search_queries" WHERE "search_queries"."id" = $1  [["id", 29]]
---
  def destroy
    @search_query = SearchQuery.find(params[:id])
    @search_query.destroy

SELECT  "search_queries".* FROM "search_queries" WHERE "search_queries"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_search_query
      @search_query = SearchQuery.find(params[:id])